{
    "basics": {
        "name": "Emina Ramovic",
        "description": "Software and Electrical Engineer || Ruby on Rails, React/Redux, SQL, CSS, HTML, MongoDB, JavaScript, Express.js, Node.js, D3.js, MathLab, AutoCAD, Python ",
        "email": "ramovicemina7@gmail.com",
        "phone": "(917)-239-9535",
        "jobStatus": "open to work",
        "url": "https://emina288.github.io/portfolio/",
        "summary": "Forward-thinking Software Engineer with a background in Electrical Engineering. Fluent in JavaScript and Ruby programming languages using creativity and performance-oriented approach. A proud team player focused on achieving project objectives with speed and accuracy.",
        "location": {
            "address": "New York City",
            "postalCode": "",
            "city": "New York",
            "countryCode": "US"
        },
        "profiles": [
            {
                "network": "LinkedIn",
                "username": "Emina Ramovic",
                "url": "https://www.linkedin.com/in/emina-ramovic-858835187/"
            },
            {
                "network": "AngelList",
                "username": "Emina Ramovic",
                "url": "https://angel.co/u/emina-ramovic"
            }
        ]
    },
    "work": [
        {
            "name": "Watt.doo",
            "endDate": "05/2019",
            "highlights": [],
            "position": "Electrical Engineer",
            "startDate": "02/2019",
            "summary": "Determined the most effective approaches to new projects by reading and analyzing blueprints, drawings, and sketches. Made decisions and worked on contracts in installing thousands of new electrical equipment, including outdoor lighting, guestrooms, and conference room electrical framework. Created and organized over millions of dollars worth of offers for illumination based on electrical installation projects in top hotels and industries in Europe. Collaborated with the main engineer to create lighting installation projects using AutoCad, 3D Max, Radiance.",
            "url": ""
        },
        {
            "name": "TVT Teuta",
            "endDate": "06/2017",
            "highlights": [],
            "position": "Electrical Engineer Intern",
            "startDate": "01/2015",
            "summary": "Proposed electrical product and system modifications to improve quality and efficiency. Assist in system design to develop new technologies. Provide feedback to management concerning possible problems or areas of improvement ",
            "url": ""
        }
    ],
    "volunteer": [
        {
            "organization": "Organization for children with special needs",
            "position": "Teacher Volunteer",
            "startDate": "2013-01-31",
            "endDate": "2013-08-31",
            "summary": "Organization for children with special needs assists in education, recreation as well as organization donors nights to collect funds for necessary treatments for the children with special needs.",
            "highlights": []
        }
    ],
    "education": [
        {
            "institution": "App Academy",
            "area": "Computer Software Engineering",
            "studyType": "",
            "startDate": "2020-03-16",
            "endDate": "2020-07-03",
            "gpa": "",
            "courses": []
        },
        {
            "institution": "University of Montenegro",
            "area": "Electrical Engineering",
            "studyType": "Bachelors in Engineering",
            "startDate": "2014-09-01",
            "endDate": "2017-06-31",
            "gpa": "",
            "courses": []
        },
        {
            "institution": "University of Montenegro ",
            "area": "Analysis of Electrical Grids",
            "studyType": "Specialization",
            "startDate": "2017-10-01",
            "endDate": "2019-01-16",
            "gpa": "",
            "courses": []
        }
    ],
    "awards": [],
    "publications": [],
    "skills": [ 
        {
            "languages": 
                ["JavaScript", "Ruby"]
        },
        {
            "stack": [
                "Ruby on Rails", "React-Redux", "Express.js", "MongoDB", "Node.js", "SQL"
            ]
        },
        {
            "allSkills": [
                "JavaScript", "Ruby", "HTML5",  "Cascading Style Sheets (CSS)", "Git", "Amazon Web Services (AWS)", "Rails",
                "React", "Redux", "MongoDB", "Express.js", "Node.js", "SQL", "jQuery", "AJAX", "Google Maps API",    
                "Application Programming Interfaces", "Test Driven Development", "PostgreSQL", "Web Development", "Front-end Development",
                "Back-end Development",
                "Microsoft Word", "Microsoft Office", "PowerPoint"
            ]
        },
        {
            "techSkills": [
                "JavaScript", "Ruby", "HTML5",  "Cascading Style Sheets (CSS)", "Git", "Amazon Web Services (AWS)", "Rails",
                "React", "Redux", "MongoDB", "Express.js", "Node.js", "SQL", "jQuery", "AJAX", "Google Maps API, D3.js, ",    
                "Application Programming Interfaces", "Test Driven Development", "PostgreSQL", "Web Development", "Front-end Development",
                "Back-end Development"
            ]
        },
        {
            "miscSkills": [
                "Microsoft Word", "Microsoft Office", "PowerPoint"
            ]
        }
    ],   
    "languages": [
        {
            "language": "English",
            "fluency": "Fluent"
        },
        {
            "language": "Montenegrian",
            "fluency": "Native Speaker"
        }
    ],
    "interests": [],
    "references": [
        {
            "name": "Gloria Kang",
            "reference": "Emina is a great team player and she excels technically. I’ve enjoyed worked with her on several projects and have always felt confident in what we produced together. Her insight and ability to problem solve has impressed me on several occasions and I know that working with her means experiencing true engineering innovation. I can attest that Emina is a quick learner, as she has come through on a MERN stack application that we worked on together several times, learning new technologies in a matter of days and implementing them so that we could meet our deadlines. I know that with Emina on my team, that we are geared for success. It is my absolute pleasure to recommend Emina."
        },
        {
            "name": "Mari Kasanuki",
            "reference": "I had the pleasure of working with Emina on a couple different projects at App Academy and I was consistently impressed. When faced with tough-to-solve bugs, she would always find innovative ways to test and rethink the issues at hand. Emina’s willingness to take on new technologies will inspire you to challenge yourself to explore uncharted areas. I always looked forward to the creative solutions she developed to implement features. I know she’d be an asset at any organization."
        },
        {
            "name": "Catherine Kim",
            "reference": "Working with Emina was an absolute pleasure. Emina always showed enthusiasm in creating and building projects, and debugging through issues that emerged. She is skilled not only in the technical attributes but the non-technical, as well. Emina is a great communicator and was an inspiration to others throughout the course. As we worked together, it became very clear that Emina’s ability to visualize connections, from front-end to back-end, is extremely strong. She has a clear vision and direction in which she wants to take, and is determined to complete the given task and beyond. She often thinks about the humanistic values that can be incorporated with technology and was the motivator behind Profferly - an application built to support communities and volunteers. There is no doubt that with the level of drive and innovation that Emina possesses, she will be a superior asset to any team."
        },
        {
            "name": "Clifford Yan",
            "reference": "Emina definitely stood out from the rest when I first worked on a project with her. Her exceptional work flow, work ethic, and communication skills made working on our project a pristine experience. Readily prepared every day, made sure she understood what was asked of her for the project and completed that project to the best of her ability. Always extremely welcoming that made the work environment very enjoyable. No matter how tense a project, always felt uplifted and jovial when paired with her. As a team member or leader, Emina earns my highest recommendation."
        }
    ],
    "projects": [
        {
            "name": "Profferly",
            "url": "http://profferly.herokuapp.com/"
        },
        {
            "name": "GoodReadsFullStack",
            "url": "https://good-reads-full-stack.herokuapp.com/#/"
        },
        {
            "name": "Power Up",
            "url": "https://emina288.github.io/power_up/"
        }
    ]
}